validation/cylinderRe30/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          250;
        startFace       249250;
    }
    outlet
    {
        type            patch;
        nFaces          250;
        startFace       249500;
    }
    freestream1
    {
        type            patch;
        nFaces          500;
        startFace       249750;
    }
    freestream2
    {
        type            patch;
        nFaces          500;
        startFace       250250;
    }
    freestream3
    {
        type            empty;
        inGroups        1(empty);
        nFaces          125000;
        startFace       250750;
    }
    freestream4
    {
        type            empty;
        inGroups        1(empty);
        nFaces          125000;
        startFace       375750;
    }
)

// ************************************************************************* //
