validation/cylinderRe30/constant/initialStates
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      initialStates;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

nParticles	1;
flow
{
    UInf    (0.3 0 0);
    rhoRef  1.4;
}
particle.0
{
    particleShape	cylinder;
    p1	(0 0 -0.1);
    p2	(0 0 0.1);
    d	0.1;
    nTheta	100;
    delta	0.005;
}

interpolationSchemes
{
    U       cellPoint;
    Uold    cellPoint;
    p       cellPoint;
    ibmSource cellPoint;
}

